{
  "title": "Personal Portfolio & Blog (pouria.ai)",
  "slug": "personal-portfolio-blog-pouria-ai",
  "description": "My personal corner of the web, showcasing projects, research, blog posts, and built with modern web tech like Next.js, Notion, and Tailwind. Yes, it's this site!",
  "abstract": "Okay, so I built this website, pouria.ai. Honestly, the main push was getting seriously tired of constantly updating my hard copy CV – keeping track of different versions for different applications was becoming a real headache. I needed a single source of truth, you know? \n\nBeyond that, I really wanted a dedicated space to actually SHOWCASE the projects I've been working on, not just list them on a resume. It's way better to let people see the work itself. AND HEY, META ALERT – YOU'RE LOOKING AT THAT VERY SHOWCASE RIGHT NOW! THIS WEBSITE IS THE PROJECT. And while thinking about showcasing things, I realized I also needed a spot to keep track of my thoughts, notes, and maybe write about tech stuff I'm exploring. That's where the idea for the blog functionality came in – a digital notebook, essentially.\n\nFinally, I saw it as a great opportunity to practice and get my hands dirty with modern web development technologies. Building something practical is always the best way to learn, right? So, here we go!\n\nThis site is built using a pretty up-to-date stack: Next.js 14 (using the App Router), React 18, and TypeScript form the foundation. For the look and feel, I used Tailwind CSS along with the excellent shadcn UI and Radix UI components for accessibility and rapid development. \n\nA neat feature is the content management – blog posts and potentially project details can be pulled directly from Notion, making updates super easy. It also supports MDX for writing content, which is great for embedding components or complex formatting. Of course, it has the essentials: sections for my Portfolio (where you're seeing this project listed!), Research publications, a Contact Form (with validation, reCAPTCHA via Google, rate limiting via Upstash Redis, and email sending via Resend), and naturally, a dark/light mode toggle because who doesn't love options?\n\nImage handling is done through Cloudinary, and the whole thing is deployed seamlessly on Vercel. It was a fun project that brought together several tools to create my personal hub online.",
  "year": 2025,
  "technologies": [
    "Next.js",
    "React",
    "TypeScript",
    "Tailwind CSS",
    "shadcn UI",
    "Radix UI",
    "Notion API",
    "MDX",
    "Cloudinary",
    "Vercel",
    "Upstash Redis",
    "Resend"
  ],
  "projectTags": [
    "Web Development",
    "Portfolio",
    "Blog",
    "Full Stack",
    "Next.js",
    "React",
    "TypeScript",
    "Personal Website",
    "UI/UX"
  ],
  "imageUrl": "https://res.cloudinary.com/dzqiwtbg6/image/upload/v1743844075/07a22a67-e619-43e8-bd86-1bdbb7023019.png",
  "liveUrl": "https://pouria.ai"
}
